
//Сгенерировано c1ExchangeGen
Функция СериализоватьСсылку(СсылкаЗнч) Экспорт

    Возврат "~~~@REF:" + Строка(ТипЗнч(СсылкаЗнч)) + "/" + Строка(СсылкаЗнч.УникальныйИдентификатор());
КонецФункции
Функция СоздатьСтруктуру_СправочникНоменклатура(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("ВидНоменклатуры", Неопределено);
    Стркт.Вставить("Артикул", Неопределено);
    Стркт.Вставить("Услуга", Неопределено);
    Стркт.Вставить("Производитель", Неопределено);
    Стркт.Вставить("НоменклатурнаяГруппа", Неопределено);
    Стркт.Вставить("НаименованиеПолное", Неопределено);
    Стркт.Вставить("Импортер", Неопределено);
    Стркт.Вставить("НомерГТД", Неопределено);
    Стркт.Вставить("СтатьяЗатрат", Неопределено);
    Стркт.Вставить("СтавкаНДС", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Комментарий", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникВидыНоменклатуры(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникНоменклатурныеГруппы(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникКонтрагенты(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("ГоловнойКонтрагент", Неопределено);
    Стркт.Вставить("КПП", Неопределено);
    Стркт.Вставить("ОсновнойБанковскийСчет", Неопределено);
    Стркт.Вставить("ОбособленноеПодразделение", Неопределено);
    Стркт.Вставить("КодПоОКПО", Неопределено);
    Стркт.Вставить("ИНН", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Комментарий", Неопределено);
    Стркт.Вставить("НаименованиеПолное", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникКонтактныеЛица(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("Описание", Неопределено);
    Стркт.Вставить("Имя", Неопределено);
    Стркт.Вставить("Фамилия", Неопределено);
    Стркт.Вставить("ДатаРождения", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Отчество", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникБанковскиеСчета(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("ДатаЗакрытия", Неопределено);
    Стркт.Вставить("СуммаБезКопеек", Неопределено);
    Стркт.Вставить("ДатаОткрытия", Неопределено);
    Стркт.Вставить("ВидСчета", Неопределено);
    Стркт.Вставить("НомерИДатаРазрешения", Неопределено);
    Стркт.Вставить("БанкДляРасчетов", Неопределено);
    Стркт.Вставить("МесяцПрописью", Неопределено);
    Стркт.Вставить("Банк", Неопределено);
    Стркт.Вставить("НомерСчета", Неопределено);
    Стркт.Вставить("ВалютаДенежныхСредств", Неопределено);
    Стркт.Вставить("ТекстКорреспондента", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("ТекстНазначения", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

Функция СоздатьСтруктуру_СправочникБанки(Объект = Неопределено) Экспорт

    Стркт = Новый Структура;
    Стркт.Вставить("Наименование", Неопределено);
    Стркт.Вставить("Адрес", Неопределено);
    Стркт.Вставить("КоррСчет", Неопределено);
    Стркт.Вставить("Телефоны", Неопределено);
    Стркт.Вставить("_ИД", Неопределено);
    Стркт.Вставить("Город", Неопределено);
    Стркт.Вставить("Код", Неопределено);

    Если Объект <> Неопределено Тогда
       ЗаполнитьЗначенияСвойств(Стркт, Объект);
       Стркт._ИД = Строка(Объект.УникальныйИдентификатор());
    КонецЕсли;
    
    Возврат Стркт;
    
КонецФункции

